Revit 2027 API
FamilySymbol.SetThermalProperties Method
 Sets the thermal properties for the given FamilySymbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetThermalProperties(
	FamilyThermalProperties thermalProperties
)
Public Sub SetThermalProperties (
	thermalProperties As FamilyThermalProperties
)
public:
void SetThermalProperties(
	FamilyThermalProperties^ thermalProperties
)
member SetThermalProperties :
        thermalProperties : FamilyThermalProperties -> unit
Parameters
thermalProperties FamilyThermalProperties
 The new thermal properties. If null, this unsets custom thermal properties for this FamilySymbol.
Exceptions
Exception | Condition
ArgumentException |  The thermal properties are not valid for assignment.
InvalidOperationException |  This FamilySymbol does not contain thermal properties.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace